52n-ses-webapp/src/main/muse-webcontent/WEB-INF/examples/RegisterPublisher.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
            xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
            xmlns:ses="http://www.opengis.net/ses/1.0.0"
            xmlns:sml="http://www.opengis.net/sensorML/1.0.1"
            xmlns:swe="http://www.opengis.net/swe/1.0"
            xmlns:wsa="http://www.w3.org/2005/08/addressing"
            xmlns:wsbn="http://docs.oasis-open.org/wsn/br-2"
            xmlns:wsrf="http://docs.oasis-open.org/wsrf/rl-2"
            xmlns:xlink="http://www.w3.org/1999/xlink" 
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
            xmlns:gml="http://www.opengis.net/gml" 
            xmlns:tses="http://www.opengis.net/ses/topics">
    <soap:Header>
        <wsa:To>${ses_host}</wsa:To>
        <wsa:Action>http://docs.oasis-open.org/wsn/brw-2/RegisterPublisher/RegisterPublisherRequest</wsa:Action>
        <wsa:MessageID>uuid:d5850046-3d5e-7338-5880-1f19252ac665</wsa:MessageID>
        <wsa:From>
            <wsa:Address>http://www.w3.org/2005/08/addressing/role/anonymous</wsa:Address>
        </wsa:From>
    </soap:Header>
    <soap:Body>
        <wsbn:RegisterPublisher>
            <wsrf:RequestedLifetimeDuration>
  3008-08-06T15:46:56+02:00
            </wsrf:RequestedLifetimeDuration>
            <wsbn:Topic
                dialect="http://docs.oasis-open.org/wsn/t-1/TopicExpression/Simple">
  tses:Measurements
            </wsbn:Topic>

      <sml:SensorML xmlns:sml="http://www.opengis.net/sensorML/1.0.1"
        xmlns:swe="http://www.opengis.net/swe/1.0.1" xmlns:gml="http://www.opengis.net/gml"
        xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="http://www.opengis.net/sensorML/1.0.1 http://schemas.opengis.net/sensorML/1.0.1/sensorML.xsd"
        version="1.0.1">

        <sml:member>
        <sml:System gml:id="ses-test:0.0.1a">

       <sml:identification>
         <sml:IdentifierList>
           <sml:identifier>
             <sml:Term
definition="urn:ogc:def:identifier:OGC:1.0:uniqueID">

<sml:value>urn:ogc:object:feature:Sesmlor:human-sesmlor-web:reporter:0123456789</sml:value>
             </sml:Term>
           </sml:identifier>
           <sml:identifier>
             <sml:Term
definition="urn:ogc:def:identifier:OGC:1.0:longName">
               <sml:value>Human Sesmlor Web Sesmlor
0123456789 (reporter)</sml:value>
             </sml:Term>
           </sml:identifier>
           <sml:identifier>
             <sml:Term
definition="urn:ogc:def:identifier:OGC:1.0:shortName">
               <sml:value>HSW Sesmlor 0123456789</sml:value>
             </sml:Term>
           </sml:identifier>
         </sml:IdentifierList>
       </sml:identification>
    
          <sml:outputs>
          <sml:OutputList>
            <sml:output name="temperature">

              <swe:Quantity definition="urn:ogc:def:phenomenon:OGC:temperature">
                <gml:description>Sea Water Temperature</gml:description>
                <swe:uom code="Cel"/>
                <!-- UCUM code for degC -->
                <swe:constraint>
                <swe:AllowedValues>
                  <swe:interval>-10.0 100.0</swe:interval>
                </swe:AllowedValues>

                </swe:constraint>
                <swe:quality xlink:role="urn:ogc:def:phenomenon:OGC:accuracy">
                <swe:Quantity definition="urn:ogc:def:sensor:OGC:absoluteAccuracy">
                  <swe:uom code="Cel"/>
                  <swe:value>0.002</swe:value>
                </swe:Quantity>
                </swe:quality>
              </swe:Quantity>

            </sml:output>
          </sml:OutputList>
          </sml:outputs>
          
        </sml:System>
        </sml:member>

      </sml:SensorML>

            <wsbn:Demand>no</wsbn:Demand>
            <wsa:EndpointReferenceType>ignore</wsa:EndpointReferenceType>
        </wsbn:RegisterPublisher>
    </soap:Body>
</soap:Envelope>